import { Component } from '@angular/core';

@Component({
  selector: 'app-hero',
  imports: [],
  templateUrl: './hero.html',
  styleUrl: './hero.scss',
})
export class Hero {
  heroStats = [
    { value: '357',   label: 'Позицій у меню' },
    { value: '5',     label: 'Розділів'        },
    { value: 'XVI',   label: 'Вік легенди'     },
  ];

  marquee = [
    '♛ Їж подільське, корона з голови не впаде',
    '🍷 Якщо пити, то вино, якщо в ресторан — до королеви',
    '🍴 Посмакувало тобі — приведи друзів',
    '♛ Ми є тим що ми їмо, дозволь собі бути смачненьким',
    '♛ Їж подільське, корона з голови не впаде',
    '🍷 Якщо пити, то вино, якщо в ресторан — до королеви',
    '🍴 Посмакувало тобі — приведи друзів',
    '♛ Ми є тим що ми їмо, дозволь собі бути смачненьким',
  ];
}
